#Определите сумму всех элементов последовательности, завершающейся числом 0.
# В этой и во всех следующих задачах числа, следующие за первым нулем, учитывать не нужно.
x=int(input())
y=0
while x!=0:
    x=int(input())
    y=y+x
print(y)    #где то ошибка
